Fix:the resubmission feedback
